const MonthColors: { [key: string]: string } = {
  '1': '#F65E5E', // 1月: 明るい赤
  '01': '#F65E5E', // 1月: 明るい赤
  '2': '#5CA1DD', // 2月: 明るい青
  '02': '#5CA1DD', // 2月: 明るい青
  '3': '#F893E2', // 3月: 明るいピンク
  '03': '#F893E2', // 3月: 明るいピンク
  '4': '#64DA51', // 4月: 明るい緑
  '04': '#64DA51', // 4月: 明るい緑
  '5': '#67C09F', // 5月: 明るいシアン
  '05': '#67C09F', // 5月: 明るいシアン
  '6': '#B47BDA', // 6月: 明るい紫
  '06': '#B47BDA', // 6月: 明るい紫
  '7': '#49D1E1', // 7月: 明るい空色
  '07': '#49D1E1', // 7月: 明るい空色
  '8': '#E58027', // 8月: 明るいオレンジ
  '08': '#E58027', // 8月: 明るいオレンジ
  '9': '#3DC02E', // 9月: 明るいライム
  '09': '#3DC02E', // 9月: 明るいライム
  '10': '#E1C84A', // 10月: 明るい黄色
  '11': '#BF5D5D', // 11月: 明るいローズ
  '12': '#4F69BF' // 12月: 明るい青紫
}

export default MonthColors
